In [1]:
import pandas as pd 
import numpy as np

## 8. 데이터 로딩과 저장

In [8]:
!dir

 C 드라이브의 볼륨에는 이름이 없습니다.
 볼륨 일련 번호: 9EDA-57A5

 C:\Users\choi\Documents\TDL\Data Analysis 디렉터리

2022-11-21  오전 10:15    <DIR>          .
2022-11-21  오전 10:15    <DIR>          ..
2022-11-21  오전 09:15    <DIR>          .ipynb_checkpoints
2022-11-15  오후 02:46    <DIR>          bike-sharing-demand
2022-11-17  오후 12:23           620,630 Data Analysis Day 3 - Numpy.ipynb
2022-11-18  오전 10:30           333,327 Data Analysis Day 3 - Pandas.ipynb
2022-11-21  오전 10:15           122,271 Data Analysis Day 4 - Pandas.ipynb
2022-11-21  오전 10:15             4,753 Data Analysis Day 5 - Pandas.ipynb
2022-11-15  오후 04:51           377,561 Data Analysis Day1.ipynb
2022-11-16  오후 05:13           892,641 Data Analysis Day2.ipynb
2022-11-21  오전 10:14    <DIR>          datasets
2022-11-20  오후 02:25             2,094 day4.md
2022-11-21  오전 10:14    <DIR>          examples
2022-11-17  오전 09:10    <DIR>          images
2022-11-15  오후 05:13            26,071 pandas와 pymysql.ipynb
2022-11-16  오전 09:12           182,704 psj.png
               9개 파일           2,562,052 바이트
               7개 디렉터리  70,685,327,360 바이트 남음

In [9]:
df=pd.read_csv('./examples/ex1.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [10]:
df.columns

Index(['a', 'b', 'c', 'd', 'message'], dtype='object')

In [13]:
df=pd.read_table('./examples/ex1.csv',sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [16]:
df=pd.read_csv('./examples/ex2.csv',header=None)
df

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [20]:
names=['a','b','c','d','message']
df=pd.read_csv('./examples/ex2.csv',names=names,index_col='message')
df

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [25]:
df=pd.read_table('./examples/ex3.txt',sep='\s+')
df

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [33]:
df=pd.read_table('./examples/ex1.csv',sep=',')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [34]:
df.to_csv('./examples/out.csv',index=False)

In [35]:
df=pd.read_csv('./examples/out.csv')
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

## 9. 데이터 정제 및 준비

### 9.1 누락된 데이터 처리하기

- 결측치 골라내기

In [37]:
type(np.nan)

float

In [38]:
string_data=pd.Series(['abc','def',np.nan,'ghi'])
string_data

0    abc
1    def
2    NaN
3    ghi
dtype: object

- 결측치 채우기

In [41]:
pd.isnull(string_data)
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [43]:
string_data=pd.Series(['abc','def',None,'ghi'])
string_data

0     abc
1     def
2    None
3     ghi
dtype: object

In [45]:
string_data.isnull() #파이썬의 None도 null로 인식

0    False
1    False
2     True
3    False
dtype: bool

In [47]:
data=pd.Series([1,np.nan,3.5,np.nan,7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [50]:
data[data.isnull()]

1   NaN
3   NaN
dtype: float64

In [51]:
data.drop([1,3])

0    1.0
2    3.5
4    7.0
dtype: float64

In [54]:
null_idx=data[data.isnull()].index
null_idx

Int64Index([1, 3], dtype='int64')

In [56]:
data.drop(null_idx)

0    1.0
2    3.5
4    7.0
dtype: float64

In [58]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [63]:
data=pd.DataFrame([[1.0,6.5,3.0],
                 [1.0,np.nan,np.nan],
                 [np.nan,np.nan,np.nan],
                  [np.nan,6.0,3.0]]
                 )
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [66]:
data.dropna() # axis=0 설정되어 있으므로 행을 삭제
                # how='any' 설정되어 있으므로 null이 하나라도 있으면 삭제
data.dropna(axis=0,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.0  3.0

In [69]:
data[100]= np.nan
data

   0    1    2    100
0  1.0  6.5  3.0  NaN
1  1.0  NaN  NaN  NaN
2  NaN  NaN  NaN  NaN
3  NaN  6.0  3.0  NaN

In [70]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.0  3.0

In [72]:
df=pd.DataFrame(np.random.randn(7,3))
df

          0         1         2
0 -1.650541 -0.675650  1.898345
1  0.029553 -0.359364  0.658277
2  0.543314 -1.194694  0.568145
3  1.325926  2.845813 -0.729912
4  1.121339 -0.001075  0.288607
5 -1.326933 -0.326143  0.123692
6 -0.864669  0.045576  0.983427

In [74]:
df.iloc[0:4,1]=np.nan
df.iloc[0:2,2]=np.nan
df

          0         1         2
0 -1.650541       NaN       NaN
1  0.029553       NaN       NaN
2  0.543314       NaN  0.568145
3  1.325926       NaN -0.729912
4  1.121339 -0.001075  0.288607
5 -1.326933 -0.326143  0.123692
6 -0.864669  0.045576  0.983427

In [76]:
df.dropna()

          0         1         2
4  1.121339 -0.001075  0.288607
5 -1.326933 -0.326143  0.123692
6 -0.864669  0.045576  0.983427

In [78]:
df.dropna(axis=1)

          0
0 -1.650541
1  0.029553
2  0.543314
3  1.325926
4  1.121339
5 -1.326933
6 -0.864669

In [79]:
df.dropna(axis=1,thresh=5) #null이 아닌 데이터가 5개보다 작은 데이터만 삭제하기

          0         2
0 -1.650541       NaN
1  0.029553       NaN
2  0.543314  0.568145
3  1.325926 -0.729912
4  1.121339  0.288607
5 -1.326933  0.123692
6 -0.864669  0.983427

- 결측치 채우기

In [82]:
df.fillna(0)

          0         1         2
0 -1.650541  0.000000  0.000000
1  0.029553  0.000000  0.000000
2  0.543314  0.000000  0.568145
3  1.325926  0.000000 -0.729912
4  1.121339 -0.001075  0.288607
5 -1.326933 -0.326143  0.123692
6 -0.864669  0.045576  0.983427

In [84]:
df.fillna({1:0,2:0.5})

          0         1         2
0 -1.650541  0.000000  0.500000
1  0.029553  0.000000  0.500000
2  0.543314  0.000000  0.568145
3  1.325926  0.000000 -0.729912
4  1.121339 -0.001075  0.288607
5 -1.326933 -0.326143  0.123692
6 -0.864669  0.045576  0.983427

In [87]:
df=pd.DataFrame(np.random.randn(6,3))
df

          0         1         2
0  0.029926  0.384280 -1.630013
1 -0.867527 -1.014380  0.498581
2  0.582046  1.498907 -0.799660
3  0.049282 -0.973453 -0.217245
4  3.747525 -1.326968  1.003922
5  0.455514  1.858315  0.011622

In [90]:
df.iloc[2:,1]=np.nan
df.iloc[4:,2]=np.nan
df

          0        1         2
0  0.029926  0.38428 -1.630013
1 -0.867527 -1.01438  0.498581
2  0.582046      NaN -0.799660
3  0.049282      NaN -0.217245
4  3.747525      NaN       NaN
5  0.455514      NaN       NaN

In [94]:
df.fillna(axis=0,method='ffill') #axis=0이므로 "행축을 따라서"

          0        1         2
0  0.029926  0.38428 -1.630013
1 -0.867527 -1.01438  0.498581
2  0.582046 -1.01438 -0.799660
3  0.049282 -1.01438 -0.217245
4  3.747525 -1.01438 -0.217245
5  0.455514 -1.01438 -0.217245

In [96]:
df.fillna(axis=1,method='ffill') #axis=1이므로 "열축을 따라서"

          0         1         2
0  0.029926  0.384280 -1.630013
1 -0.867527 -1.014380  0.498581
2  0.582046  0.582046 -0.799660
3  0.049282  0.049282 -0.217245
4  3.747525  3.747525  3.747525
5  0.455514  0.455514  0.455514

In [99]:
df.fillna(axis=0,method='ffill',limit=2) #axis=1이므로 "열축을 따라서"

          0        1         2
0  0.029926  0.38428 -1.630013
1 -0.867527 -1.01438  0.498581
2  0.582046 -1.01438 -0.799660
3  0.049282 -1.01438 -0.217245
4  3.747525      NaN -0.217245
5  0.455514      NaN -0.217245

In [100]:
df.mean(axis=0)

0    0.666128
1   -0.315050
2   -0.537084
dtype: float64

In [101]:
m=df.mean(axis=0).mean()
df.fillna(m)

          0         1         2
0  0.029926  0.384280 -1.630013
1 -0.867527 -1.014380  0.498581
2  0.582046 -0.062002 -0.799660
3  0.049282 -0.062002 -0.217245
4  3.747525 -0.062002 -0.062002
5  0.455514 -0.062002 -0.062002

### 9.2 데이터 변형

- 중복 제거하기

In [108]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [110]:
#중복인지 체크
data.duplicated(keep='first')

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [112]:
#중복인지 체크
data.duplicated(keep='last') #킵 위치에 따라 중복의 대상이 바뀜

0    False
1    False
2    False
3    False
4    False
5     True
6    False
dtype: bool

In [117]:
#k1열 기준으로 삭제

data.drop_duplicates(['k1']) #킵 위치에 따라 중복의 대상이 바뀜

    k1  k2
0  one   1
1  two   1

In [119]:
data.duplicated(['k1'],keep='last')

0     True
1     True
2     True
3     True
4    False
5     True
6    False
dtype: bool

In [121]:
data.drop_duplicates(['k1'],keep='last') #false가 남음

    k1  k2
4  one   3
6  two   4

In [124]:
data['v1']= range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [ ]:
data.drop_duplicates()

- 값 치환하기

In [125]:
data=pd.Series([1,-999,2,-999,-1000,3])
data

0       1
1    -999
2       2
3    -999
4   -1000
5       3
dtype: int64

In [126]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [128]:
data.replace([-999,1000],[np.nan,0])

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [130]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

- 축 색인 이름 바꾸기

In [132]:
data=pd.DataFrame(np.arange(12).reshape(3,4),index=['Ohio','Colorado','New York'],
             columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [134]:
data.index

Index(['Ohio', 'Colorado', 'New York'], dtype='object')

In [135]:
def upper_tx(x):
    return x.upper()

In [137]:
data.index.map(upper_tx)

Index(['OHIO', 'COLORADO', 'NEW YORK'], dtype='object')

In [140]:
data.rename(index={'Ohio':'Indiana'})

          one  two  three  four
Indiana     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [142]:
data.rename(index=str.upper,columns=str.title)  #title은 첫자만 대문자 나머지는 소문자

          One  Two  Three  Four
OHIO        0    1      2     3
COLORADO    4    5      6     7
NEW YORK    8    9     10    11

- 데이터 구간 분할

In [143]:
# 수치데이터(양적데이터) -> 범주형데이터(질적데이터)
ages=[20,22,25,27,21,23,37,31,61,45,41,32]
ages

[20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [153]:
pd.cut(ages,4)
bins=[18,25,35,60,100]
cats=pd.cut(ages,bins,labels=['Youth','YoungAdult','MiddleAged','Senior'])
type(cats)

pandas.core.arrays.categorical.Categorical

In [154]:
cats

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [155]:
pd.value_counts(cats)

Youth         5
YoungAdult    3
MiddleAged    3
Senior        1
dtype: int64

In [159]:
cats=pd.cut(ages,4)
pd.value_counts(cats)

(19.959, 30.25]    6
(30.25, 40.5]      3
(40.5, 50.75]      2
(50.75, 61.0]      1
dtype: int64

In [158]:
qcats=pd.qcut(ages,4)
pd.value_counts(qcats)

(19.999, 22.75]    3
(22.75, 29.0]      3
(29.0, 38.0]       3
(38.0, 61.0]       3
dtype: int64

- 특잇값(바깥값, outlier) 찾고 제외하기

In [160]:
data=pd.DataFrame(np.random.randn(1000,4))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.045431    -0.012117    -0.062085    -0.026419
std       0.981011     1.008162     0.970630     1.059885
min      -3.363965    -2.855987    -3.869585    -2.861330
25%      -0.708496    -0.668956    -0.712903    -0.808865
50%      -0.047233    -0.042529    -0.065975    -0.009819
75%       0.579399     0.671197     0.585753     0.722872
max       3.890215     3.138764     3.449726     3.183461

In [161]:
#3보다 큰 값을 특잇값(바깥값, outlier)로 가정을 하고 해당되는 값을 3으로 치환

In [163]:
(data>3).any(axis=1).sum()

6

In [165]:
data[(data>3).any(axis=1)]

            0         1         2         3
75  -1.053298  3.138764 -1.752842  1.283187
236  3.890215  1.923670 -0.286921 -1.769832
264  0.045769 -0.052454 -0.445431  3.183461
312  0.683585  0.783771  3.449726  0.280752
486  3.357185 -1.130062 -0.500470 -0.917418
724  1.591015  1.063640  3.024572  0.348928

In [166]:
data[data>3]=3

In [167]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.046678    -0.012256    -0.062559    -0.026602
std       0.976655     1.007737     0.969027     1.059345
min      -3.363965    -2.855987    -3.869585    -2.861330
25%      -0.708496    -0.668956    -0.712903    -0.808865
50%      -0.047233    -0.042529    -0.065975    -0.009819
75%       0.579399     0.671197     0.585753     0.722872
max       3.000000     3.000000     3.000000     3.000000

- 더미변수 계산하기(one-hot encoding)

In [169]:
df=pd.DataFrame({'fruit':['apple','apple','pear','peach','pear'],'data':range(5)})
df

   fruit  data
0  apple     0
1  apple     1
2   pear     2
3  peach     3
4   pear     4

In [170]:
dummies=pd.get_dummies(df['fruit'],prefix='fruit')
dummies

   fruit_apple  fruit_peach  fruit_pear
0            1            0           0
1            1            0           0
2            0            0           1
3            0            1           0
4            0            0           1

In [172]:
pd.concat([df[['data']],dummies],axis=1)

   data  fruit_apple  fruit_peach  fruit_pear
0     0            1            0           0
1     1            1            0           0
2     2            0            0           1
3     3            0            1           0
4     4            0            0           1